---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Size
source: html/4b22dba1-a866-c980-f990-f131caa1a377.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Size Property

Returns the number of TemperatureRating types that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```